
## Plan Result (parser-graphql-wrapper-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/69337)


<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4
  * local_file.application_ecs_service_appspec_94386B9C


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4 will be created
  + resource "aws_ecs_task_definition" "application_ecs_service_ecs-task_461CC9D4" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + cpu                    = 0
                  + environment            = [
                      + {
                          + name  = "ENVIRONMENT"
                          + value = "production"
                        },
                      + {
                          + name  = "OTLP_COLLECTOR_HOST"
                          + value = "localhost"
                        },
                      + {
                          + name  = "REDIS_IS_CLUSTER"
                          + value = "true"
                        },
                      + {
                          + name  = "REDIS_IS_TLS"
                          + value = "true"
                        },
                      + {
                          + name  = "REDIS_PRIMARY_ENDPOINT"
                          + value = "parsergraphqlwrapper-prod-serverless-zcx42u.serverless.use1.cache.amazonaws.com"
                        },
                      + {
                          + name  = "REDIS_READER_ENDPOINT"
                          + value = "parsergraphqlwrapper-prod-serverless-zcx42u.serverless.use1.cache.amazonaws.com"
                        },
                    ]
                  + essential              = true
                  + healthCheck            = {
                      + command     = [
                          + "CMD-SHELL",
                          + "curl -f http://localhost:4001/.well-known/apollo/server-health || exit 1",
                        ]
                      + interval    = 5
                      + retries     = 3
                      + startPeriod = 30
                      + timeout     = 5
                    }
                  + image                  = "996905175585.dkr.ecr.us-east-1.amazonaws.com/parsergraphqlwrapper-prod-app:33bd25fb7d8bee8f1efdd9869e0626786ad80216"
                  + logConfiguration       = {
                      + logDriver     = "awslogs"
                      + options       = {
                          + awslogs-group             = "/Backend/ParserGraphQLWrapper-Prod/ecs/app"
                          + awslogs-multiline-pattern = "^\\S.+"
                          + awslogs-region            = "us-east-1"
                          + awslogs-stream-prefix     = "ecs"
                        }
                      + secretOptions = []
                    }
                  + mountPoints            = []
                  + name                   = "app"
                  + portMappings           = [
                      + {
                          + containerPort = 4001
                          + hostPort      = 4001
                        },
                    ]
                  + readonlyRootFilesystem = false
                  + secrets                = [
                      + {
                          + name      = "DB_HOST"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:ParserGraphQLWrapper/Prod/READITLA_DB:host::"
                        },
                      + {
                          + name      = "DB_PASSWORD"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:ParserGraphQLWrapper/Prod/READITLA_DB:password::"
                        },
                      + {
                          + name      = "DB_USERNAME"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:ParserGraphQLWrapper/Prod/READITLA_DB:username::"
                        },
                      + {
                          + name      = "PARSER_URL"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:ParserWrapperApi/Prod/SECRETS:parser_endpoint::"
                        },
                      + {
                          + name      = "POCKET_SHARES_DATABASE_WRITE_HOST"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:ParserWrapperApi/Prod/POCKET_SHARES:host::"
                        },
                      + {
                          + name      = "POCKET_SHARES_DATABASE_WRITE_PASSWORD"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:ParserWrapperApi/Prod/POCKET_SHARES:password::"
                        },
                      + {
                          + name      = "POCKET_SHARES_DATABASE_WRITE_USER"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:ParserWrapperApi/Prod/POCKET_SHARES:username::"
                        },
                      + {
                          + name      = "SENTRY_DSN"
                          + valueFrom = "arn:aws:ssm:us-east-1:996905175585:parameter/ParserGraphQLWrapper/Prod/SENTRY_DSN"
                        },
                      + {
                          + name      = "SHORT_CODE_CHARS"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:ParserWrapperApi/Prod/SECRETS:short_code_chars::"
                        },
                      + {
                          + name      = "SHORT_PREFIX"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:ParserWrapperApi/Prod/SECRETS:short_prefix::"
                        },
                      + {
                          + name      = "SHORT_PREFIX_SECURE"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:ParserWrapperApi/Prod/SECRETS:short_prefix_secure::"
                        },
                    ]
                  + volumesFrom            = []
                },
              + {
                  + command                = [
                      + "--config=/etc/ecs/ecs-xray.yaml",
                    ]
                  + cpu                    = 0
                  + environment            = []
                  + essential              = true
                  + image                  = "amazon/aws-otel-collector"
                  + logConfiguration       = {
                      + logDriver     = "awslogs"
                      + options       = {
                          + awslogs-group             = "/Backend/ParserGraphQLWrapper-Prod/ecs/aws-otel-collector"
                          + awslogs-multiline-pattern = "^\\S.+"
                          + awslogs-region            = "us-east-1"
                          + awslogs-stream-prefix     = "ecs"
                        }
                      + secretOptions = []
                    }
                  + mountPoints            = []
                  + name                   = "aws-otel-collector"
                  + portMappings           = [
                      + {
                          + containerPort = 4138
                          + hostPort      = 4138
                        },
                      + {
                          + containerPort = 4137
                          + hostPort      = 4137
                        },
                    ]
                  + readonlyRootFilesystem = false
                  + repositoryCredentials  = {
                      + credentialsParameter = "arn:aws:secretsmanager:us-east-1:996905175585:secret:Shared/DockerHub"
                    }
                  + volumesFrom            = []
                },
            ]
        )
      + cpu                      = "2048"
      + execution_role_arn       = "arn:aws:iam::996905175585:role/ParserGraphQLWrapper-Prod-TaskExecutionRole"
      + family                   = "ParserGraphQLWrapper-Prod"
      + id                       = (known after apply)
      + memory                   = "4096"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = true
      + tags                     = {
          + "environment" = "Prod"
          + "service"     = "ParserGraphQLWrapper"
        }
      + tags_all                 = {
          + "environment" = "Prod"
          + "service"     = "ParserGraphQLWrapper"
        }
      + task_role_arn            = "arn:aws:iam::996905175585:role/ParserGraphQLWrapper-Prod-TaskRole"
      + track_latest             = false
    }

  # local_file.application_ecs_service_appspec_94386B9C will be created
  + resource "local_file" "application_ecs_service_appspec_94386B9C" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "appspec.json"
      + id                   = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobID":"2d1b8d18-5306-43c7-8f9c-db62d510d2d3","JobName":"parser-graphql-wrapper_infrastructure_plan_prod","PRNumber":243,"Program":"tfcmt","SHA1":"33bd25fb7d8bee8f1efdd9869e0626786ad80216","Target":"parser-graphql-wrapper-cdk","Vars":{}} -->